04_VendaMultipla/payload-multiplos-items.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://multiclubes.com.br/tickets/v2">
    <soapenv:Header>
        <_AuthenticationKey xmlns="ns">3fe6ca43-65cc-4776-9fb8-667855dbd6e0</_AuthenticationKey>
    </soapenv:Header>
    <soapenv:Body>
        <v2:Sell>
            <v2:data>
                <v2:PaymentLink>
                    <v2:DueDays>2</v2:DueDays>
                    <v2:WebhookUrl>https://webh.criativamaisdigital.com.br/webhook/66015730-101c-4441-b93b-bdbecc963461</v2:WebhookUrl>
                </v2:PaymentLink>
                <v2:Tickets>
                    <!-- Item 1 -->
                    <v2:SaleItemData>
                        <v2:Quantity>1</v2:Quantity>
                        <v2:TicketId>823815</v2:TicketId>
                        <v2:Values>
                            <v2:DueValue>101.00</v2:DueValue>
                        </v2:Values>
                    </v2:SaleItemData>
                    <!-- Item 2 -->
                    <v2:SaleItemData>
                        <v2:Quantity>1</v2:Quantity>
                        <v2:TicketId>823815</v2:TicketId>
                        <v2:Values>
                            <v2:DueValue>101.00</v2:DueValue>
                        </v2:Values>
                    </v2:SaleItemData>
                </v2:Tickets>
                <v2:Values>
                    <v2:DueValue>202.00</v2:DueValue>
                </v2:Values>
                <v2:VisitDate>2025-12-28</v2:VisitDate>
                <v2:Visitor>
                    <v2:Document>04553529173</v2:Document>
                    <v2:Email>juniorsereno.br@gmail.com</v2:Email>
                    <v2:Name>Junior Sereno</v2:Name>
                    <v2:PhoneNumber>61981435045</v2:PhoneNumber>
                </v2:Visitor>
            </v2:data>
        </v2:Sell>
    </soapenv:Body>
</soapenv:Envelope>